In [1]:
import numpy as np
import pandas as pd
import matplotlib as mpl
import matplotlib.pyplot as plt

In [14]:
data = {'김철수':[60,70], 
        '홍길동':[70,75],
        '박영희':[80,85]}
coll = 'kor','eng'

x = pd.DataFrame(data)
x

   김철수  홍길동  박영희
0   60   70   80
1   70   75   85

In [26]:
d = {'id':['김철수', '홍길도','박영희'],
    'kor':[60,70,80],
    'eng':[70,75,85]
}
col = ['김철수', '홍길도','박영희']
z = pd.DataFrame(data=d)

In [23]:
z

    id  kor  eng
0  김철수   60   70
1  홍길도   70   75
2  박영희   80   85

In [31]:
z = z.set_index('id') # 특정 컬럼 색인 지정, 다시 열로주는 설정은 reset

In [29]:
z.kor = z.kor + 5  # 국어 점수만 5점씩 상승
z

    id  kor  eng
0  김철수   65   70
1  홍길도   75   75
2  박영희   85   85

In [30]:
def gob(x,n):
    return x * n

In [34]:
z.kor.apply(gob, n=2) # 적용된 값을 보여주는 거지 실제 z라는 데이터에 값이 저장된 것은 아님.

id
김철수    130
홍길도    150
박영희    170
Name: kor, dtype: int64

In [38]:
# 컬럼 방향으로의 평균을 구해주는 함수 applyBycolumn() 정의
def applyBycolumn(c):
    mysum = 0
    for i in c:
        mysum += i
    return mysum/z.shape[0]  # 0이 axis방향을 말하는 거 같은데,,, 그래서 행을 기준으로 열단위 연산 이라 컬럼의 평균을 구해줄수 있는 듯

z.apply(applyBycolumn, axis = 0)

kor    75.000000
eng    76.666667
dtype: float64

In [39]:
z.apply(applyBycolumn) # axis옵션이 없어도 가능 위에서 나눌떄더ㅗ 그런 값이었으니...

kor    75.000000
eng    76.666667
dtype: float64

In [40]:
# 행방향으로 다시 저으이
def aBrow(r):
    rowsum = 0
    for i in r:
        rowsum += i
    return rowsum / z.shape[1]

In [42]:
z.apply(aBrow, axis=1) # axis가 필수인데,, 기본값이 0이라서 열단위 작업에서는 없어도 가능한것,,

id
김철수    67.5
홍길도    75.0
박영희    85.0
dtype: float64

In [44]:
fm = lambda x : '%.1f점'%x
z.applymap(fm)   # 모든 요소에 적용하는 방법

       kor    eng
id
김철수  65.0점  70.0점
홍길도  75.0점  75.0점
박영희  85.0점  85.0점

In [45]:
sample = {'name':['홍길동', '홍길동', '김철수','박영희','김철수','김철수','홍길동'],
         'kor':range(7)} # 0~6까지 7개
df1 = pd.DataFrame(sample)
df1

  name  kor
0  홍길동    0
1  홍길동    1
2  김철수    2
3  박영희    3
4  김철수    4
5  김철수    5
6  홍길동    6

In [47]:
sam2 = {'name':['김철수','홍길동','심수봉'],
       'eng':range(3)}
df2 = pd.DataFrame(sam2)
df2

  name  eng
0  김철수    0
1  홍길동    1
2  심수봉    2

In [50]:
# 데이터프레임 합치기
pd.merge(df1, df2, on='name')
## df1과 df2에서 동일한 이름의 자료들만 뽑아온다. 그래서 영희와 수봉이가 제외된 값이 뜬것(innerjoin)

  name  kor  eng
0  홍길동    0    1
1  홍길동    1    1
2  홍길동    6    1
3  김철수    2    0
4  김철수    4    0
5  김철수    5    0

In [51]:
pd.merge(df1,df2, how='outer') # 동일하지 않아도 누락값을 부여해서 생성한 걸 확인할 수 있음

  name  kor  eng
0  홍길동  0.0  1.0
1  홍길동  1.0  1.0
2  홍길동  6.0  1.0
3  김철수  2.0  0.0
4  김철수  4.0  0.0
5  김철수  5.0  0.0
6  박영희  3.0  NaN
7  심수봉  NaN  2.0

In [56]:
df1.columns = ['leftKey','kor']
df1

  leftKey  kor
0     홍길동    0
1     홍길동    1
2     김철수    2
3     박영희    3
4     김철수    4
5     김철수    5
6     홍길동    6

In [57]:
df2.columns = ['rightKey','eng']
df2

  rightKey  eng
0      김철수    0
1      홍길동    1
2      심수봉    2

In [58]:
pd.merge(df1,df2, left_on='leftKey', right_on='rightKey')

  leftKey  kor rightKey  eng
0     홍길동    0      홍길동    1
1     홍길동    1      홍길동    1
2     홍길동    6      홍길동    1
3     김철수    2      김철수    0
4     김철수    4      김철수    0
5     김철수    5      김철수    0

In [61]:
dict1 = {'key1':['김철수', '김철수','박영희'],
         'key2':['one','two','one'],
         'leftVal':range(3)
}
df_1 = pd.DataFrame(dict1)
df_1

  key1 key2  leftVal
0  김철수  one        0
1  김철수  two        1
2  박영희  one        2

In [60]:
dict2 = {'key1':['김철수', '김철수','박영희','박영희'],
        'key2': ['one','one','one','two'],
        'leftVal':[3,4,5,6]}
df_2 = pd.DataFrame(dict2)
df_2

  key1 key2  leftVal
0  김철수  one        3
1  김철수  one        4
2  박영희  one        5
3  박영희  two        6

In [87]:
mIdx = ['마포구','용산구','서대문구','동대문구','은평구','구로구','강서구']
mylist = [40,80,70,50,60,30,20]
mSr = pd.Series(data=mylist, index=mIdx)
mSr

마포구     40
용산구     80
서대문구    70
동대문구    50
은평구     60
구로구     30
강서구     20
dtype: int64

In [66]:
mSr.loc[['은평구']]

은평구    60
dtype: int64

In [69]:
mSr.loc['서대문구':'구로구']

서대문구    70
동대문구    50
은평구     60
구로구     30
dtype: int64

In [71]:
mSr[['용산구','동대문구']]

용산구     80
동대문구    50
dtype: int64

In [73]:
mSr[[2]]

서대문구    70
dtype: int64

In [74]:
mSr[[0,2,4]]

마포구     40
서대문구    70
은평구     60
dtype: int64

In [75]:
mSr.iloc[[1,3,4]]

용산구     80
동대문구    50
은평구     60
dtype: int64

In [76]:
mSr[2:4]

서대문구    70
동대문구    50
dtype: int64

In [88]:
mSr[2]=99
mSr

마포구     40
용산구     80
서대문구    99
동대문구    50
은평구     60
구로구     30
강서구     20
dtype: int64

In [89]:
mSr[2:4]=66
mSr

마포구     40
용산구     80
서대문구    66
동대문구    66
은평구     60
구로구     30
강서구     20
dtype: int64

In [90]:
mSr['마포구','강서구'] = 55
mSr

마포구     55
용산구     80
서대문구    66
동대문구    66
은평구     60
구로구     30
강서구     55
dtype: int64

In [92]:
mSr[[2,4,6]]=77
mSr

마포구     55
용산구     80
서대문구    77
동대문구    66
은평구     77
구로구     30
강서구     77
dtype: int64